In [19]:
import pandas as pd
import numpy as np

In [20]:
df = pd.read_csv("titanic.csv")

In [21]:
df.describe(percentiles=[0.1,0.2,0.3,0.4,0.5,0.6,0.7,0.8,0.9,0.99])

               age      ticketno         fare        sibsp        parch
count  2205.000000  1.316000e+03  1291.000000  1307.000000  1307.000000
mean     30.444444  2.842157e+05    33.404760     0.499617     0.385616
std      12.151764  6.334726e+05    52.227592     1.042273     0.866092
min       0.166667  2.000000e+00     3.030500     0.000000     0.000000
10%      18.000000  2.668000e+03     7.140800     0.000000     0.000000
20%      21.000000  1.166800e+04     7.170600     0.000000     0.000000
30%      24.000000  1.758100e+04     8.010000     0.000000     0.000000
40%      26.000000  2.840300e+04    11.020800     0.000000     0.000000
50%      29.000000  1.114265e+05    14.090200     0.000000     0.000000
60%      32.000000  2.376680e+05    22.070200     0.000000     0.000000
70%      36.000000  3.309755e+05    27.140500     1.000000     0.000000
80%      40.000000  3.492170e+05    42.080000     1.000000     1.000000
90%      46.000000  3.686375e+05    78.050400     1.000000     2.000000
99%      63.000000  3.101304e+06   262.070600     5.000000     4.000000
max      74.000000  3.101317e+06   512.060700     8.000000     9.000000

In [22]:
df['age'].quantile(0.01)

2.0

In [23]:
del df["ticketno"]

In [24]:
df.at[0,"age"]

42.0

In [25]:
df.at[0,"age"] = 52 

print("After updating : ")

df.at[0,"age"]

After updating :

52.0

In [27]:
print(df.index.name)

None

In [28]:
# Rather than setting Number as index, here we are setting object as index.
df_index = df.set_index(df["name"])

In [30]:
print(df_index.index.name)

name

In [32]:
df_index.loc["Abbott, Mr. Eugene Joseph"]

name        Abbott, Mr. Eugene Joseph
gender                           male
age                              13.0
class                             3rd
embarked                            S
country                 United States
fare                            20.05
sibsp                             0.0
parch                             2.0
survived                           no
Name: Abbott, Mr. Eugene Joseph, dtype: object

In [33]:
# iloc wont work with object
df_index.iloc["Abbott, Mr. Eugene Joseph"]

TypeError: Cannot index by location index with a non-integer key

In [34]:
df_index.loc[1:4]

TypeError: cannot do slice indexing on Index with these indexers [1] of type int

In [35]:
df_index.iloc[1:4]

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived
name,,,,,,,,,,
"Abbott, Mr. Eugene Joseph","Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,20.05,0.0,2.0,no
"Abbott, Mr. Rossmore Edward","Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,20.05,1.0,1.0,no
"Abbott, Mrs. Rhoda Mary 'Rosa'","Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,20.05,1.0,1.0,yes

In [36]:
# reset index 

df_index.reset_index(drop=True, inplace=True)
df_index.head()

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived
0,"Abbing, Mr. Anthony",male,52.0,3rd,S,United States,7.11,0.0,0.0,no
1,"Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,20.05,0.0,2.0,no
2,"Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,20.05,1.0,1.0,no
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,20.05,1.0,1.0,yes
4,"Abelseth, Miss. Karen Marie",female,16.0,3rd,S,Norway,7.13,0.0,0.0,yes

### Navigating Dataframe

In [37]:
# create a sub table 
female_df = df[df["gender"] == "female"]
female_df.shape

(489, 10)

In [41]:
# create sub table with multuple conditions using logical 'and'
df_f_age = df[(df['gender']=="female") & (df["age"]> 50) ]

# OR 
# create sub table with multuple conditions using logical 'and'
df_f_age = df[(df['gender']=="female") | (df["age"]> 50) ]

In [43]:
# OR AND Combined


df[((df.gender == "Female") & (df.age > 30)) | ((df.gender == "male") & (df.age < 30))].shape

(862, 10)

In [44]:
#Replace values with new lables in a categorical column
df['gender'].replace(['female', 'male'],['W','M']).head(5)

0    M
1    M
2    M
3    W
4    W
Name: gender, dtype: object

In [45]:
#Create a new columns
df['sex'] = df['gender'].replace(['female', 'male'], [1,0])
df['sex'].value_counts()

/tmp/ipykernel_1813/625522512.py:2: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['sex'] = df['gender'].replace(['female', 'male'], [1,0])

sex
0    1718
1     489
Name: count, dtype: int64

In [46]:
#Get the count of unique values in a categorical column
df['gender'].value_counts(dropna=False)

gender
male      1718
female     489
Name: count, dtype: int64

In [47]:
df['survived_ind'] = df['survived'].replace(['yes','no'],[1,0])
df.survived_ind.value_counts(dropna=False)

/tmp/ipykernel_1813/1954361289.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['survived_ind'] = df['survived'].replace(['yes','no'],[1,0])

survived_ind
0    1496
1     711
Name: count, dtype: int64

In [48]:
pd.crosstab(df['sex'], df['gender'], margins=True, margins_name='total')

gender  female  male  total
sex
0            0  1718   1718
1          489     0    489
total      489  1718   2207

In [49]:
crosstab = pd.crosstab(df['survived'], df['gender'], margins=True, margins_name='total')
crosstab.to_csv('crosstab.csv')
crosstab

gender    female  male  total
survived
no           130  1366   1496
yes          359   352    711
total        489  1718   2207

In [50]:
del crosstab

In [54]:
crosstab = pd.crosstab(df['survived'],[ df['gender'], df['class']], margins=True, margins_name='total')

In [55]:
crosstab

gender   female                                             male            \
class       1st  2nd  3rd restaurant staff victualling crew  1st  2nd  3rd
survived
no            5   12  110                0                3  118  154  418
yes         139   94  106                2               18   62   24   75
total       144  106  216                2               21  180  178  493

gender                                                                total
class    deck crew engineering crew restaurant staff victualling crew
survived
no              23              253               66              334  1496
yes             43               71                1               76   711
total           66              324               67              410  2207

**Rename Column**

In [57]:
# old : new 
df.rename(columns={"class": "passenger_class"}, inplace= True)
df.head(1)

,name,gender,age,passenger_class,embarked,country,fare,sibsp,parch,survived,sex,survived_ind
0,"Abbing, Mr. Anthony",male,52.0,3rd,S,United States,7.11,0.0,0.0,no,0,0

In [ ]:
df[df["age"]].notna()

In [65]:
print(f"Number of rows : {df.shape[0]}")
print(type(df[df["age"].notna()].shape))

print(df[df["age"].notna()].shape[0])

Number of rows : 2207
<class 'tuple'>
2205

In [63]:
df[df["age"].notna()].shape

(2205, 12)

In [67]:
df[df["age"].isnull() == True].shape[0]

2

#### Unique value

In [68]:
df["country"].nunique()

48

In [69]:
df["country"].unique()

array(['United States', 'England', 'Norway', 'France', 'Lebanon',
       'Finland', 'Sweden', 'Argentina', 'Canada', 'Denmark',
       'Northern Ireland', 'Bulgaria', 'Switzerland', 'Channel Islands',
       'Bosnia', 'Hungary', nan, 'Ireland', 'Italy', 'India', 'Wales',
       'South Africa', 'Croatia (Modern)', 'Scotland', 'Siam', 'Uruguay',
       'Belgium', 'Poland', 'Australia', 'Peru', 'Spain', 'Egypt',
       'Japan', 'Syria', 'Russia', 'Slovenia', 'Greece', 'Turkey',
       'China/Hong Kong', 'Austria', 'Latvia', 'Yugoslavia',
       'Slovakia (Modern day)', 'Germany', 'Croatia', 'Cuba',
       'Netherlands', 'Mexico', 'Guyana'], dtype=object)

In [72]:
df["country"].value_counts(dropna=False)

country
England                  1125
United States             264
Ireland                   137
Sweden                    105
NaN                        81
Lebanon                    71
Finland                    54
Scotland                   36
Canada                     34
France                     26
Norway                     26
Belgium                    22
Northern Ireland           21
Wales                      20
Bulgaria                   19
Switzerland                18
Channel Islands            17
Croatia (Modern)           12
Croatia                    11
Italy                      11
Spain                       9
India                       8
Hungary                     7
Denmark                     7
Argentina                   7
South Africa                6
Germany                     6
Turkey                      6
Australia                   5
Slovenia                    4
Bosnia                      4
Poland                      3
Austria                     3
Netherlands                 2
Greece                      2
Siam                        2
Russia                      2
Peru                        2
Uruguay                     2
Syria                       1
China/Hong Kong             1
Japan                       1
Latvia                      1
Yugoslavia                  1
Slovakia (Modern day)       1
Egypt                       1
Cuba                        1
Mexico                      1
Guyana                      1
Name: count, dtype: int64

In [82]:
df_c = pd.crosstab(
    
    df["country"], df["survived_ind"], margins= True , margins_name='total'
)

In [83]:
df_c["percetage"] = (df_c[1] /df_c["total"]) * 100

In [86]:
df_c.sort_values("percetage",ascending=False)

survived_ind              0    1  total   percetage
country
Japan                     0    1      1  100.000000
Syria                     0    1      1  100.000000
Egypt                     0    1      1  100.000000
Siam                      0    2      2  100.000000
China/Hong Kong           0    1      1  100.000000
Spain                     2    7      9   77.777778
India                     2    6      8   75.000000
Poland                    1    2      3   66.666667
Switzerland               7   11     18   61.111111
France                   11   15     26   57.692308
United States           112  152    264   57.575758
Russia                    1    1      2   50.000000
Germany                   3    3      6   50.000000
Peru                      1    1      2   50.000000
Channel Islands           9    8     17   47.058824
Canada                   19   15     34   44.117647
Lebanon                  40   31     71   43.661972
Ireland                  90   47    137   34.306569
Turkey                    4    2      6   33.333333
South Africa              4    2      6   33.333333
Austria                   2    1      3   33.333333
total                  1443  683   2126   32.126058
Finland                  37   17     54   31.481481
Norway                   19    7     26   26.923077
Sweden                   77   28    105   26.666667
England                 831  294   1125   26.133333
Slovenia                  3    1      4   25.000000
Belgium                  17    5     22   22.727273
Scotland                 28    8     36   22.222222
Northern Ireland         17    4     21   19.047619
Italy                     9    2     11   18.181818
Croatia (Modern)         10    2     12   16.666667
Wales                    17    3     20   15.000000
Hungary                   6    1      7   14.285714
Denmark                   6    1      7   14.285714
Greece                    2    0      2    0.000000
Slovakia (Modern day)     1    0      1    0.000000
Netherlands               2    0      2    0.000000
Cuba                      1    0      1    0.000000
Mexico                    1    0      1    0.000000
Guyana                    1    0      1    0.000000
Croatia                  11    0     11    0.000000
Bulgaria                 19    0     19    0.000000
Bosnia                    4    0      4    0.000000
Latvia                    1    0      1    0.000000
Uruguay                   2    0      2    0.000000
Australia                 5    0      5    0.000000
Yugoslavia                1    0      1    0.000000
Argentina                 7    0      7    0.000000

#### Groupby

In [88]:
df["company"] = df["sibsp"] + df["parch"]
df.groupby("gender")["company"].mean()

gender
female    1.285408
male      0.663496
Name: company, dtype: float64

In [89]:
df.groupby("gender")["age"].mean()

gender
female    29.042434
male      30.849796
Name: age, dtype: float64

In [92]:
pd.DataFrame(df.groupby(["gender","survived_ind"])["age"].mean())

                           age
gender survived_ind
female 0             26.053846
       1             30.124652
male   0             31.299792
       1             29.106061

In [93]:
df.groupby('gender')['name'].count()

gender
female     489
male      1718
Name: name, dtype: int64

In [94]:
df.groupby('gender').apply(lambda x : x.count())

/tmp/ipykernel_1813/4182734304.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df.groupby('gender').apply(lambda x : x.count())

,name,gender,age,passenger_class,embarked,country,fare,sibsp,parch,survived,sex,survived_ind,company
gender,,,,,,,,,,,,,
female,489,489,489,489,489,464,466,466,466,489,489,489,466
male,1718,1718,1716,1718,1718,1662,825,841,841,1718,1718,1718,841

In [95]:
def upper_case(x):
    return x.upper()

df["new_col"] = df["name"].apply(upper_case)

In [96]:
df["new_col"].head()

0               ABBING, MR. ANTHONY
1         ABBOTT, MR. EUGENE JOSEPH
2       ABBOTT, MR. ROSSMORE EDWARD
3    ABBOTT, MRS. RHODA MARY 'ROSA'
4       ABELSETH, MISS. KAREN MARIE
Name: new_col, dtype: object

In [99]:

data_a = {
    "id" : ["1","2","3",],
    "first" : ["Alex", "Amy", "Allen"], 
    "last" : ["Anderson", "Ackerman","Ali"]
}

df_a = pd.DataFrame(data_a, columns= list(data_a.keys()))

In [100]:
data_b = {
    "id" : ["4","5","6",],
    "first" : ["Billy", "Brian", "Barn"], 
    "last" : ["Bonder", "Black","Balwner"]
    
}
df_b = pd.DataFrame(data_b, columns= list(data_b.keys()))

In [101]:
pd.concat([df_a,df_b], axis=1)

  id  first      last id  first     last
0  1   Alex  Anderson  4  Billy   Bonder
1  2    Amy  Ackerman  5  Brian    Black
2  3  Allen       Ali  6   Barn  Balwner

In [102]:
pd.concat([df_a,df_b], axis=0)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Black
2  6   Barn   Balwner